tap "aws/tap"
tap "fluxcd/tap"
tap "homebrew/autoupdate"
# tap "felixkratz/formulae" # Sketchybar tap

# Core system tools
brew "ca-certificates"          # CA certificates
brew "cmake"                    # Build system
brew "coreutils"                # GNU core utilities
brew "curl"                     # HTTP client
brew "gcc"                      # C compiler
brew "git"                      # Version control
brew "gnu-getopt", link: true   # GNU getopt
brew "gnu-sed"                  # GNU sed
brew "gnupg"                    # GPG for signing commits
brew "imagemagick"              # Image conversion and editing
brew "make"                     # Build tool
brew "pinentry-mac"             # Pinentry for GPG
brew "stow"                     # Symlink farm manager
brew "wget"                     # File downloader
brew "zsh"                      # Z shell (though macOS has it by default)
brew "zsh-autosuggestions"      # Zsh autosuggestions
brew "zsh-completions"          # Zsh completions
brew "zsh-syntax-highlighting"  # Zsh syntax highlighting

# Modern CLI tools (replacements for standard tools)
brew "atuin"              # Enhanced history manager
brew "doge"               # Modern dig alternative
brew "eza"                # Modern ls replacement
brew "fzf"                # Fuzzy finder
brew "grpcurl"            # cURL for gRPC services
brew "procs"              # Process viewer
brew "ripgrep"            # Fast grep replacement
brew "starship"           # Cross-shell prompt
brew "websocat"           # socat for WebSockets
brew "zoxide"             # Smart cd command

# Development tools
brew "jq"                 # JSON processor
brew "k9s"                # Kubernetes CLI UI
brew "mise"               # CLI tool to manage tool versions
brew "neovim"             # Text editor
brew "oras"               # OCI registry tool
brew "tmux"               # Terminal multiplexer
brew "uv"                 # Python version management utility
brew "yq"                 # YAML processor
brew "dyff"               # YAML diff tool

# Programming languages and runtimes
brew "go"                 # Go language
brew "golangci-lint"      # Go linter

# Code quality tools
brew "shellcheck"         # Shell script linter
brew "shfmt"              # Shell script formatter

# Cloud tools (optional)
brew "awscli"             # AWS CLI
brew "gh"
brew "mas"                # Mac App Store CLI
# brew "sketchybar"

# GUI applications

# Core apps
cask "1password"
cask "1password-cli"
cask "ghostty"
cask "obsidian"
cask "orbstack"
cask "raycast"
cask "visual-studio-code"

# AI
cask "claude-code"

# Fonts
cask "font-damion"                    # Design/display font
cask "font-fira-code-nerd-font"       # Alternative programming font
cask "font-hack-nerd-font"            # Alternative programming font
cask "font-jetbrains-mono-nerd-font"  # Primary programming font


# cask "httpie-desktop"
# cask "iterm2"
# cask "logi-options+"
# cask "mitmproxy"
# cask "ngrok"
# cask "slack"
# cask "spotify"

# mas "1Password for Safari", id: 1569813296
# mas "CleanMyMac", id: 1339170533
# mas "FileZilla Pro", id: 1298486723
# mas "GarageBand", id: 682658836
# mas "HP Smart", id: 1474276998
# mas "HP", id: 1474276998
# mas "Keynote", id: 409183694
# mas "Microsoft To Do", id: 1274495053
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
# mas "Slack", id: 803453959
# mas "TestFlight", id: 899247664
# mas "Windows App", id: 1295203466
# mas "Xcode", id: 497799835
# mas "Xerox Print and Scan Experience", id: 6443456959
# mas "Yubico Authenticator", id: 1497506650
# mas "djay Pro", id: 450527929
# mas "iMovie", id: 408981434
