tap "aws/tap"
tap "homebrew/autoupdate"
# tap "felixkratz/formulae" # Sketchybar tap

# Core system tools
brew "ca-certificates"          # CA certificates
brew "coreutils"                # GNU core utilities
brew "gcc"                      # C compiler
brew "git"                      # Version control
brew "gnu-getopt", link: true   # GNU getopt
brew "gnupg"                    # GPG for signing commits
brew "imagemagick"              # Image conversion and editing
brew "pinentry-mac"             # Pinentry for GPG
brew "stow"                     # Symlink farm manager

# Shell
brew "zsh"                      # Z shell (though macOS has it by default)
brew "zsh-completions"          # Zsh completions
brew "starship"                 # Cross-shell prompt

# Filesystem and networking tools
brew "doge"                     # Modern dig alternative
brew "eza"                      # Modern ls replacement
brew "wget"                     # File downloader
brew "grpcurl"                  # cURL for gRPC services
brew "websocat"                 # socat for WebSockets
brew "zoxide"                   # Smart cd command

# Modern CLI tools (replacements for standard tools)
brew "atuin"              # Enhanced history manager
brew "fzf"                # Fuzzy finder
brew "procs"              # Process viewer
brew "ripgrep"            # Fast grep replacement
brew "gnu-sed"            # GNU sed

# Development tools
brew "jq"                 # JSON processor
brew "k9s"                # Kubernetes CLI UI
brew "mise"               # CLI tool to manage tool versions
brew "neovim"             # Text editor
brew "oras"               # OCI registry tool
brew "tmux"               # Terminal multiplexer
brew "uv"                 # Python version management utility
brew "yq"                 # YAML processor
brew "dyff"               # YAML diff tool

# Languages/Tools
brew "shellcheck"         # Shell script linter
brew "shfmt"              # Shell script formatter
brew "gh"
brew "go"                 # Go language
brew "golangci-lint"      # Go linter
brew "awscli"             # AWS CLI

brew "mas"                # Mac App Store CLI
# brew "sketchybar"

# GUI applications

# Core apps
cask "1password"
cask "1password-cli"
cask "ghostty"
cask "obsidian"
cask "orbstack"
cask "raycast"
cask "visual-studio-code"

# AI
cask "claude-code"

# Fonts
cask "font-damion"                    # Design/display font
cask "font-fira-code-nerd-font"       # Alternative programming font
cask "font-hack-nerd-font"            # Alternative programming font
cask "font-jetbrains-mono-nerd-font"  # Primary programming font


# cask "httpie-desktop"
# cask "iterm2"
# cask "logi-options+"
# cask "mitmproxy"
# cask "ngrok"
# cask "slack"
# cask "spotify"

# mas "CleanMyMac", id: 1339170533
# mas "Slack", id: 803453959
# mas "Xcode", id: 497799835
# mas "Yubico Authenticator", id: 1497506650
